tap "homebrew/bundle"
tap "homebrew/cask-versions"

brew "mas"
brew "chezmoi"
brew "powerlevel10k"
brew "gh"
brew "git"
brew "htop"
brew "jq"
brew "libpq"
brew "node"
brew "openjdk"
brew "telnet"
brew "tfenv"
brew "wget"
brew "yarn"
brew "docker"

# Dev
cask "miniconda"
cask "pycharm"
cask "visual-studio-code"
cask "iterm2"
cask "alfred"
cask "google-chrome"
cask "slack"
cask "sublime-text"
cask "skype"
cask "kdiff3"

# Other
cask "spotify"
cask "zoom"
cask "backblaze"
cask "setapp"
cask "google-drive"
cask "microsoft-office"


# Additional apps
#mas '1Password', id: 1333542190
#mas 'WhatsApp Desktop', id: 1147396723
#mas 'Telegram', id: 747648890
#mas 'HP Smart for Desktop', id: 1474276998
#mas 'Todoist: To do list e tarefas', id: 585829637
#mas 'Okta Verify', id: 490179405
#mas 'Xcode', id: 497799835

vscode "erd0s.terraform-autocomplete"
vscode "hashicorp.terraform"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"