tap "homebrew/bundle"
tap "homebrew/cask-versions"
brew "masp"
brew "chezmoi"
brew "gh"
brew "git"
cask "iterm2"
brew "htop"
brew "jq"
brew "libpq"
brew "node"
brew "openjdk"
brew "telnet"
brew "tfenv"
brew "wget"
brew "yarn"


# Additional apps
mas '1Password', id: 1333542190
mas 'WhatsApp Desktop', id: 1147396723
mas 'Telegram', id: 747648890

vscode "erd0s.terraform-autocomplete"
vscode "hashicorp.terraform"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"